"""Чи можуть бути об'єкти ключами в словнику і чому?

Можуть, якщо вони є хешованими, тобто об'єкти, які можна захешувати,
щоб потім можна було використовувати для пошуку в словнику.
Наприклад, числові значення, рядки, кортежі, set. Списки, словарі не можуть бути ключами.
Клас може бути ключем в словнику.
У всіх класах Python є методи __hash__, __eq__, однак, для того, щоб клас мав змогу бути ключем в словнику,
ці методи повинні бути визначені і працювати так, як треба.
Якщо не перевизначен метод __hash__, об'єкт класу буде хешованим, але об'єкти
різних екземплярів класу можуть вважатися різними і не зможуть бути використаними в якості ключа у словнику.
Також треба перевизначити метод __eq__, щоб правильно порівнювати захешовані об'єкти.
Але не всі класи потребують перевизначення цих методів"""



